<a href="https://colab.research.google.com/github/mlhudson1/CIDM4310-70_Pandas/blob/main/Chapter1Fixed.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [12]:
import pandas as pd

Creating a Series

In [13]:
ser1 = pd.Series([10,20,30,40])

Displaying the Series

In [14]:
ser1

0    10
1    20
2    30
3    40
dtype: int64

In [15]:
ser2 = pd.Series([[10,20], [30,40.5, 'series'], [50,55],{'Name':'Tess','Org':'Packt'}])
ser2

0                            [10, 20]
1                  [30, 40.5, series]
2                            [50, 55]
3    {'Name': 'Tess', 'Org': 'Packt'}
dtype: object

Create a DataFrame using the constructor

In [16]:
df = pd.DataFrame([30,50,20])

Display the DataFrame

In [17]:
df

    0
0  30
1  50
2  20

In [18]:
df.shape

(3, 1)

In [19]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [20]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
print("These are the names of the columns",list(df.columns))
print("These are the row indices", list(df.index))

These are the names of the columns [0]
These are the row indices [0, 1, 2]

Renaming the columns

In [22]:
df.columns = ['V1']
df

   V1
0  30
1  50
2  20

Renaming the indices

In [23]:
df.index=['R1','R2','R3']
df

    V1
R1  30
R2  50
R3  20

Creating DataFrame with multiple columns

In [24]:
df1=pd.DataFrame([[10,15,20],[100,200,300]])
print("Shape of new data frame",df1.shape)
df1

Shape of new data frame (2, 3)

     0    1    2
0   10   15   20
1  100  200  300

In [26]:
df1=pd.DataFrame([[10,15,20],[100,200,300]])
print("Sample of new data frame",df1.head)

Sample of new data frame <bound method NDFrame.head of      0    1    2
0   10   15   20
1  100  200  300>

In [28]:
df1= pd.DataFrame([[10,15,20],[100,200,300]], columns=['V1','V2','V3'], index=['R1','R2'])
df1

     V1   V2   V3
R1   10   15   20
R2  100  200  300

# Working with local files - Reading a CSV file

In [32]:
filename="Chapter1-Datasets/student-por.csv"
delimiter=";"
studentData=pd.read_csv(filename,delimiter)

C:\Users\miran\AppData\Local\Temp\ipykernel_10372\1160861211.py:3: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  studentData=pd.read_csv(filename,delimiter)

In [33]:
studentData.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,4,0,11,11
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,2,9,11,11
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,6,12,13,12
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,0,14,14,14
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,0,11,13,13

In [34]:
studentSmall=studentData.head()

In [37]:
outpath="Chapter1-Datasets/studentSmall.csv"
#Write the data to disk
studentSmall.to_csv(outpath)

# Data Types in Pandas

In [39]:
studentData.dtypes

school        object
sex           object
age            int64
address       object
famsize       object
Pstatus       object
Medu           int64
Fedu           int64
Mjob          object
Fjob          object
reason        object
guardian      object
traveltime     int64
studytime      int64
failures       int64
schoolsup     object
famsup        object
paid          object
activities    object
nursery       object
higher        object
internet      object
romantic      object
famrel         int64
freetime       int64
goout          int64
Dalc           int64
Walc           int64
health         int64
absences       int64
G1             int64
G2             int64
G3             int64
dtype: object

In [40]:
studentData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 649 entries, 0 to 648
Data columns (total 33 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      649 non-null    object
 1   sex         649 non-null    object
 2   age         649 non-null    int64
 3   address     649 non-null    object
 4   famsize     649 non-null    object
 5   Pstatus     649 non-null    object
 6   Medu        649 non-null    int64
 7   Fedu        649 non-null    int64
 8   Mjob        649 non-null    object
 9   Fjob        649 non-null    object
 10  reason      649 non-null    object
 11  guardian    649 non-null    object
 12  traveltime  649 non-null    int64
 13  studytime   649 non-null    int64
 14  failures    649 non-null    int64
 15  schoolsup   649 non-null    object
 16  famsup      649 non-null    object
 17  paid        649 non-null    object
 18  activities  649 non-null    object
 19  nursery     649 non-null    object
 20  higher      649 non-null    object
 21  internet    649 non-null    object
 22  romantic    649 non-null    object
 23  famrel      649 non-null    int64
 24  freetime    649 non-null    int64
 25  goout       649 non-null    int64
 26  Dalc        649 non-null    int64
 27  Walc        649 non-null    int64
 28  health      649 non-null    int64
 29  absences    649 non-null    int64
 30  G1          649 non-null    int64
 31  G2          649 non-null    int64
 32  G3          649 non-null    int64
dtypes: int64(16), object(17)
memory usage: 167.4+ KB

In [41]:
# Converting 'Medu' to data type float
studentData['Medu'] = studentData['Medu'].astype('float')
studentData.dtypes

school         object
sex            object
age             int64
address        object
famsize        object
Pstatus        object
Medu          float64
Fedu            int64
Mjob           object
Fjob           object
reason         object
guardian       object
traveltime      int64
studytime       int64
failures        int64
schoolsup      object
famsup         object
paid           object
activities     object
nursery        object
higher         object
internet       object
romantic       object
famrel          int64
freetime        int64
goout           int64
Dalc            int64
Walc            int64
health          int64
absences        int64
G1              int64
G2              int64
G3              int64
dtype: object

In [42]:
studentData.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4.0,4,at_home,teacher,...,4,3,4,1,1,3,4,0,11,11
1,GP,F,17,U,GT3,T,1.0,1,at_home,other,...,5,3,3,1,1,3,2,9,11,11
2,GP,F,15,U,LE3,T,1.0,1,at_home,other,...,4,3,2,2,3,3,6,12,13,12
3,GP,F,15,U,GT3,T,4.0,2,health,services,...,3,2,2,1,1,5,0,14,14,14
4,GP,F,16,U,GT3,T,3.0,3,other,other,...,4,3,2,1,2,5,0,11,13,13

# Data selection